Configuration/Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокДоговоровБезАкта</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАктов</name>
    <attributes>
      <name>ПериодАкта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументСсылка</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Configuration/Диплом/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration/Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Объект.Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());  
	Объект.Период.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.СписокАктов.Очистить();
	Если Месяц(Объект.Период.ДатаНачала) <> Месяц(Объект.Период.ДатаОкончания) Тогда
		Объект.Период.ДатаОкончания = КонецМесяца(Объект.Период.ДатаНачала);
		//НовоеСообщение = Новый СообщениеПользователю;
		//НовоеСообщение.Поле = "Период"; 
		//НовоеСообщение.Текст = "В поле периода нужно выбирать период МЕСЯЦ";
		//НовоеСообщение.Сообщить();
		ОбщегоНазначенияКлиент.СообщитьПользователю("В поле периода нужно выбирать период МЕСЯЦ");
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверкаАктов(Команда)   
	АдресТЗ = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор); 
	Объект.СписокДоговоровБезАкта.Очистить();
	ПроверкаАктовНаСервере(АдресТЗ);
	//Объект.РеквизитАдресТЗ = АдресТЗ;
КонецПроцедуры 

&НаКлиенте
Процедура ФормироватеАктов(Команда)  
    АдресТЗ = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	Объект.СписокДоговоровБезАкта.Очистить();
	ПолучитьМассивДоговоровБезАктов(АдресТЗ);
	Если Объект.СписокДоговоровБезАкта.Количество() >0 Тогда
		ФормированиеАктовНаСервере(АдресТЗ);  
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

#Область ОбработчикиСобытийПроверкиАктов 

&НаКлиенте	
Процедура ПроверкаАктовНаСервере(АдресТЗ)
	ДлительнаяОперация = ПроверкаАктовНаСервереДлительнаяОперация(АдресТЗ);
	ПарамтерыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);//ЭтотОбъект - эта форма
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("АдресТЗ", АдресТЗ); 
	ФункцияВыполнения = Новый ОписаниеОповещения("СтатусВыполненияФукнции", ЭтотОбъект, ДопПараметры);//здесь м.б. ДополнительныеПараметры, котоыре мы м. передавать или не передавать
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ФункцияВыполнения,ПарамтерыОжидания);
КонецПроцедуры

&НаСервере 
функция ПроверкаАктовНаСервереДлительнаяОперация(АдресТЗ)
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); //ИД формы (УникальныйИдентификатор)
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"Обработки.ВКМ_МассовоеСозданиеАктов.ПроверкаАктовДлитльнаяОперация", Объект.Период, АдресТЗ, 0);
	Возврат ДлительнаяОперация;
КонецФункции

//&НаКлиенте	
//Процедура СтатусВыполненияФукнцииПроверка(Результат, ДополнительныеПараметры) экспорт
//	Если Результат = Неопределено Тогда 
//		Возврат ;
//	КонецЕсли;
//	Если Результат.Статус = "Ошибка" тогда 
//		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
//		Возврат;
//	КонецЕсли;
//	ЗначениеФункции = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
//	ОбщегоНазначенияКлиент.СообщитьПользователю(ЗначениеФункции);
//	АдресТЗ_ = ДополнительныеПараметры.АдресТЗ;
//	ОтобразитьТЗ(АдресТЗ_);
//КонецПроцедуры 

//&НаСервере
//Процедура ОтобразитьТЗ (АдресТЗ_)
//		ТЗ = ПолучитьИзВременногоХранилища(АдресТЗ_);
//		Объект.СписокАктов.Очистить();
//		Объект.СписокАктов.Загрузить(ТЗ);
//		УдалитьИзВременногоХранилища(АдресТЗ_);
//КонецПроцедуры  

	
#КонецОбласти
//----------------------------------------------------------------------------------
#Область ОбработчикиСобытийСозданиеАктов 

&НаСервере
Процедура ПолучитьМассивДоговоровБезАктов(АдресТЗ)
	МассивДоговоровБезАктов = Новый Массив;
	Отбор = Новый Структура();
	Отбор.Вставить("ДокументСсылка", Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	МассивДоговоровБезАктов = Объект.СписокАктов.НайтиСтроки(Отбор);
	
	Если МассивДоговоровБезАктов.Количество() > 0 Тогда
		Для Каждого Элемент из МассивДоговоровБезАктов Цикл    
			Объект.СписокДоговоровБезАкта.Добавить(Элемент.Договор);
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте	
Процедура ФормированиеАктовНаСервере(АдресТЗ)
	ДлительнаяОперация = ФормироватеАктовНаСервереДлительнаяОперация(АдресТЗ);
	ПарамтерыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);//ЭтотОбъект - эта форма
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("АдресТЗ", АдресТЗ);
	ФункцияВыполнения = Новый ОписаниеОповещения("СтатусВыполненияФукнции", ЭтотОбъект, ДопПараметры);//здесь м.б. ДополнительныеПараметры, котоыре мы м. передавать или не передавать
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ФункцияВыполнения,ПарамтерыОжидания);
КонецПроцедуры

&НаСервере 
функция ФормироватеАктовНаСервереДлительнаяОперация(АдресТЗ) 
	МассивДоговоровБезАктов = Объект.СписокДоговоровБезАкта.ВыгрузитьЗначения();
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); //ИД формы (УникальныйИдентификатор)
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"Обработки.ВКМ_МассовоеСозданиеАктов.ФормированиеАктовДлитльнаяОперация", Объект.Период, АдресТЗ, МассивДоговоровБезАктов);
	Возврат ДлительнаяОперация;
КонецФункции 

#КонецОбласти
//----------------------------------------------------------------------------------
#Область ОбработчикиОбщихСобытий

&НаКлиенте	
Процедура СтатусВыполненияФукнции(Результат, ДополнительныеПараметры) экспорт
	// Статус выполнения фукнции
	
	Если Результат = Неопределено Тогда 
		Возврат ;
	КонецЕсли;
	Если Результат.Статус = "Ошибка" тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	ЗначениеФункции = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ЗначениеФункции);
	АдресТЗ_ = ДополнительныеПараметры.АдресТЗ;
	ОтобразитьТЗ(АдресТЗ_);
КонецПроцедуры 

&НаСервере
Процедура ОтобразитьТЗ(АдресТЗ_)
		ТЗ_ = ПолучитьИзВременногоХранилища(АдресТЗ_);
		Объект.СписокАктов.Очистить();
		Объект.СписокАктов.Загрузить(ТЗ_);
		УдалитьИзВременногоХранилища(АдресТЗ_);
КонецПроцедуры  

#КонецОбласти 

#КонецОбласти
